read_blif test_unopt.blif
techmap -autoproc -map +/xilinx/cells_sim.v
techmap -map +/adff2dff.v
synth
opt_clean -purge
rmports
write_blif test_opt.blif
